catalog_data:
  test:
    foo:
      - {'_id': 0, 'a': 1}

catalog_schema:
  {
    'test': {
      'foo': {
        'bsonType': 'object',
        'additionalProperties': true,
      }
    }
  }

tests:
  - description: basic array datasource correctness test
    query: "SELECT * FROM [{'a': 1, 'b': 1}] AS arr"
    current_db: test
    result:
      - {'arr': {'a': 1, 'b': 1}}

  - description: unqualified reference to field from array datasource
    query: "SELECT VALUE {'a': a} FROM [{'a': 1, 'b': 1}] AS arr"
    current_db: test
    result:
      - {'': {'a': 1}}

  - description: qualified reference to field from array datasource
    query: "SELECT VALUE {'a': arr.a} FROM [{'a': 1, 'b': 1}] AS arr"
    current_db: test
    result:
      - {'': {'a': 1}}

  - description: array datasource must have alias
    query: "SELECT * FROM [{'a': 1}]"
    current_db: test
    should_compile: false
    parse_error: "array datasources must have aliases"

  - description: empty array datasource is allowed
    query: "SELECT * FROM [] AS arr"
    current_db: test
    result: []

  - description: array datasource with single empty document is allowed
    query: "SELECT * FROM [{}] AS _dual"
    current_db: test
    result:
      - {'_dual': {}}

  - description: array datasource elements must be documents
    query: "SELECT * FROM [{'a': 1}, null] AS arr"
    current_db: test
    should_compile: false
    algebrize_error: 'schema checking failed for array datasource items: required Document(Document { keys: {}, required: {}, additional_properties: true }), found AnyOf({Atomic(Null), Document(Document { keys: {"a": Atomic(Integer)}, required: {"a"}, additional_properties: false })})'

  - description: array datasource must be array literal
    query: "SELECT * FROM {'a': [{'b': 1}]}['a'] AS arr"
    should_compile: false
    parse_error: "parse error: Error 2000: found unsupported expression used as datasource: {'a': [{'b': 1}]}['a']"

  - description: array datasource cannot be referenced as value
    query: "SELECT arr FROM [{'a': 1}] AS arr"
    current_db: test
    should_compile: false
    algebrize_error: "field `arr` cannot be resolved to any datasource"

  - description: references in array datasources are disallowed
    query: "SELECT (SELECT * FROM [{'a': foo.a}] AS arr) FROM foo"
    current_db: test
    should_compile: false
    algebrize_error: "array datasource must be constant"
