tests:
  - description: generated alias for simple identifier is same identifier
    query:  "SELECT a FROM foo AS foo"
    result: "SELECT VALUE {'a': a} FROM foo AS foo"

  - description: generated alias for compound identifier is last component
    query:  "SELECT a.b.c FROM foo AS foo"
    result: "SELECT VALUE {'c': a.b.c} FROM foo AS foo"

  - description: explicit aliases are used as field names
    query: "SELECT a AS b FROM foo AS foo"
    result: "SELECT VALUE {'b': a} FROM foo AS foo"

  - description: expression aliases are generated from select-list position
    query: "SELECT a+b, 123 FROM foo AS foo"
    result: "SELECT VALUE {'_1': a + b, '_2': 123} FROM foo AS foo"

  - description: alias numbering accounts for explicit and identifier-generated aliases
    query: "SELECT a, 123, b AS c, 456 FROM foo AS foo"
    result: "SELECT VALUE {'a': a, '_2': 123, 'c': b, '_4': 456} FROM foo AS foo"

  - description: duplicate identifiers may be generated by rewrites, though semantically invalid
    query: "SELECT 123, 456 AS _1 FROM foo AS foo"
    result: "SELECT VALUE {'_1': 123, '_1': 456} FROM foo AS foo"

  - description: explicit ALL set quantifier rewritten to implicit ALL in select value
    query:  "SELECT ALL VALUE {'a': 1} FROM foo AS foo"
    result: "SELECT VALUE {'a': 1} FROM foo AS foo"

  - description: explicit ALL set quantifier rewritten to implicit ALL in standard select
    query:  "SELECT ALL a FROM foo AS foo"
    result: "SELECT VALUE {'a': a} FROM foo AS foo"

  - description: implicit FROM with sql92-compatible select rewritten to explicit FROM
    query: "SELECT 123 AS num"
    result: "SELECT VALUE {'num': 123} FROM [{}] AS _dual"

  - description: implicit FROM rewritten to explicit FROM with SELECT VALUE
    query: "SELECT VALUE {'num': 123}"
    result: "SELECT VALUE {'num': 123} FROM [{}] AS _dual"

  - description: rewrite standalone sub-star expression to SELECT VALUE
    query: "SELECT t.* FROM t AS t"
    result: "SELECT VALUE t.* FROM t AS t"

  - description: rewrite multiple sub-star expressions to SELECT VALUES
    query: "SELECT t.*, a.* FROM t AS t"
    result: "SELECT VALUES t.*, a.* FROM t AS t"

  - description: rewrite sub-star expression and other expressions to SELECT VALUES
    query: "SELECT a AS a, t.* FROM t AS t"
    result: "SELECT VALUES {'a': a}, t.* FROM t AS t"

  - description: rewrite VALUE to VALUES with multiple expressions
    query:  "SELECT VALUE a.*, b.* FROM a AS a CROSS JOIN b AS b"
    result: "SELECT VALUES a.*, b.* FROM a AS a CROSS JOIN b AS b"

  - description: rewrite VALUES to VALUE with single expression
    query:  "SELECT VALUES {'a': foo} FROM a"
    result: "SELECT VALUE {'a': foo} FROM a AS a"

  - description: SELECT VALUE is not supported in subquery expressions
    query: "SELECT VALUE {'a': (SELECT VALUE {'b': b} FROM bar AS bar)} FROM foo AS foo"
    error: "SELECT VALUE is not supported in subquery expressions"
